# **SQL Learning Project with Jupyter Lab**

Libraries needed:
- ipython-sql
- SQLAchemy,
- psycopg2 (for PostgreSQL database)

In [1]:
import pandas as pd

In [2]:
%load_ext sql

To connect to the database you need to run: <br>
**%sql dialect+driver://username:password@host:port/database**

In [3]:
#connecting to dvdrental on PostgreSQL 
%sql postgresql://postgres:#postgreSQL@localhost/dvdrental

'Connected: postgres@dvdrental'

Single '%' is for query that can be fitted in one line. <br>
Double '%%' is for converting whole cell to the SQL input.

Displaying list of tables in database.

In [86]:
%%sql
SELECT schemaname AS schema, tablename AS table FROM pg_catalog.pg_tables
WHERE schemaname = 'public';

 * postgresql://postgres:***@localhost/dvdrental
15 rows affected.

[('public', 'actor'),
 ('public', 'store'),
 ('public', 'address'),
 ('public', 'category'),
 ('public', 'city'),
 ('public', 'country'),
 ('public', 'customer'),
 ('public', 'film_actor'),
 ('public', 'film_category'),
 ('public', 'inventory'),
 ('public', 'language'),
 ('public', 'rental'),
 ('public', 'staff'),
 ('public', 'payment'),
 ('public', 'film')]

Displaying list of columns in given table.

In [7]:
%%sql
SELECT column_name 
FROM INFORMATION_SCHEMA.COLUMNS
WHERE TABLE_NAME='rental'
ORDER BY ordinal_position ASC

 * postgresql://postgres:***@localhost/dvdrental
7 rows affected.

[('rental_id',),
 ('rental_date',),
 ('inventory_id',),
 ('customer_id',),
 ('return_date',),
 ('staff_id',),
 ('last_update',)]

In [8]:
%%sql
SELECT column_name 
FROM INFORMATION_SCHEMA.COLUMNS
WHERE TABLE_NAME='payment'
ORDER BY ordinal_position ASC

 * postgresql://postgres:***@localhost/dvdrental
6 rows affected.

[('payment_id',),
 ('customer_id',),
 ('staff_id',),
 ('rental_id',),
 ('amount',),
 ('payment_date',)]

In [9]:
%sql SELECT * FROM payment LIMIT 3

 * postgresql://postgres:***@localhost/dvdrental
3 rows affected.

[(17503, 341, 2, 1520, Decimal('7.99'), datetime.datetime(2007, 2, 15, 22, 25, 46, 996577)),
 (17504, 341, 1, 1778, Decimal('1.99'), datetime.datetime(2007, 2, 16, 17, 23, 14, 996577)),
 (17505, 341, 1, 1849, Decimal('7.99'), datetime.datetime(2007, 2, 16, 22, 41, 45, 996577))]

Finding customer_id for top 5 customers selected by amount spend.

In [12]:
%%sql
SELECT customer_id, SUM(amount) FROM payment
GROUP BY customer_id
ORDER BY SUM(amount) DESC
LIMIT 5;

 * postgresql://postgres:***@localhost/dvdrental
5 rows affected.

[(148, Decimal('211.55')),
 (526, Decimal('208.58')),
 (178, Decimal('194.61')),
 (137, Decimal('191.62')),
 (144, Decimal('189.60'))]

In [18]:
%%sql
SELECT MIN(EXTRACT (YEAR FROM payment_date)) FROM payment;

 * postgresql://postgres:***@localhost/dvdrental
1 rows affected.

[(Decimal('2007'),)]

In [17]:
%%sql
SELECT MAX(EXTRACT (YEAR FROM payment_date)) FROM payment;

 * postgresql://postgres:***@localhost/dvdrental
1 rows affected.

[(Decimal('2007'),)]

In [19]:
%%sql
SELECT * FROM customer
LIMIT 5;

 * postgresql://postgres:***@localhost/dvdrental
5 rows affected.

[(524, 1, 'Jared', 'Ely', 'jared.ely@sakilacustomer.org', 530, True, datetime.date(2006, 2, 14), datetime.datetime(2013, 5, 26, 14, 49, 45, 738000), 1),
 (1, 1, 'Mary', 'Smith', 'mary.smith@sakilacustomer.org', 5, True, datetime.date(2006, 2, 14), datetime.datetime(2013, 5, 26, 14, 49, 45, 738000), 1),
 (2, 1, 'Patricia', 'Johnson', 'patricia.johnson@sakilacustomer.org', 6, True, datetime.date(2006, 2, 14), datetime.datetime(2013, 5, 26, 14, 49, 45, 738000), 1),
 (3, 1, 'Linda', 'Williams', 'linda.williams@sakilacustomer.org', 7, True, datetime.date(2006, 2, 14), datetime.datetime(2013, 5, 26, 14, 49, 45, 738000), 1),
 (4, 2, 'Barbara', 'Jones', 'barbara.jones@sakilacustomer.org', 8, True, datetime.date(2006, 2, 14), datetime.datetime(2013, 5, 26, 14, 49, 45, 738000), 1)]

Listing all views public or usercreated that are present in database.

In [82]:
%%sql
SELECT 
    table_schema AS schema,
    table_name AS view
FROM 
    information_schema.views
WHERE 
    table_schema NOT IN ('information_schema', 'pg_catalog')
ORDER BY 
    schema ASC, 
    view ASC;

 * postgresql://postgres:***@localhost/dvdrental
10 rows affected.

[('public', 'actor_info'),
 ('public', 'country_city'),
 ('public', 'customer_info'),
 ('public', 'customer_list'),
 ('public', 'film_list'),
 ('public', 'film_master'),
 ('public', 'nicer_but_slower_film_list'),
 ('public', 'sales_by_film_category'),
 ('public', 'sales_by_store'),
 ('public', 'staff_list')]

Creating view containing first name, last name and email address for top 5 customers selected by amount spend.

In [83]:
%%sql
CREATE VIEW top_5_customers_by_revenue
AS
SELECT 
    customer_id,
	first_name, 
	last_name, 
	email,
    SUM(amount)
FROM 
	customer
INNER JOIN payment 
	USING (customer_id)
GROUP BY customer_id, first_name, last_name, email
ORDER BY SUM(amount) DESC
LIMIT 5;

 * postgresql://postgres:***@localhost/dvdrental
Done.

[]

In [85]:
%%sql
SELECT * FROM top_5_customers_by_revenue;

 * postgresql://postgres:***@localhost/dvdrental
5 rows affected.

[(148, 'Eleanor', 'Hunt', 'eleanor.hunt@sakilacustomer.org', Decimal('211.55')),
 (526, 'Karl', 'Seal', 'karl.seal@sakilacustomer.org', Decimal('208.58')),
 (178, 'Marion', 'Snyder', 'marion.snyder@sakilacustomer.org', Decimal('194.61')),
 (137, 'Rhonda', 'Kennedy', 'rhonda.kennedy@sakilacustomer.org', Decimal('191.62')),
 (144, 'Clara', 'Shaw', 'clara.shaw@sakilacustomer.org', Decimal('189.60'))]

In [81]:
# %%sql
# DROP VIEW top_5_test;

In [105]:
%%sql
SELECT * FROM payment
LIMIT 1;

 * postgresql://postgres:***@localhost/dvdrental
1 rows affected.

[(17503, 341, 2, 1520, Decimal('7.99'), datetime.datetime(2007, 2, 15, 22, 25, 46, 996577))]

In [104]:
%%sql
SELECT * FROM RENTAL
LIMIT 1;

 * postgresql://postgres:***@localhost/dvdrental
1 rows affected.

[(2, datetime.datetime(2005, 5, 24, 22, 54, 33), 1525, 459, datetime.datetime(2005, 5, 28, 19, 40, 33), 1, datetime.datetime(2006, 2, 16, 2, 30, 53))]

In [103]:
%%sql
SELECT * FROM inventory
LIMIT 1;

 * postgresql://postgres:***@localhost/dvdrental
1 rows affected.

[(1, 1, 1, datetime.datetime(2006, 2, 15, 10, 9, 17))]

In [102]:
%%sql
SELECT * FROM film
LIMIT 1;

 * postgresql://postgres:***@localhost/dvdrental
1 rows affected.

[(133, 'Chamber Italian', 'A Fateful Reflection of a Moose And a Husband who must Overcome a Monkey in Nigeria', 2006, 1, 7, Decimal('4.99'), 117, Decimal('14.99'), 'NC-17', datetime.datetime(2013, 5, 26, 14, 50, 58, 951000), ['Trailers'], "'chamber':1 'fate':4 'husband':11 'italian':2 'monkey':16 'moos':8 'must':13 'nigeria':18 'overcom':14 'reflect':5")]

Top 10 movies most often rented.

In [101]:
%%sql
SELECT title, COUNT(rental_id) AS times_rented FROM payment
INNER JOIN rental
    USING (rental_id)
INNER JOIN inventory
    USING (inventory_id)
INNER JOIN film
    USING (film_id)
GROUP BY title
ORDER BY COUNT(rental_id) DESC
LIMIT 10;

 * postgresql://postgres:***@localhost/dvdrental
10 rows affected.

[('Juggler Hardly', 29),
 ('Scalawag Duck', 29),
 ('Shock Cabin', 29),
 ('Grit Clockwork', 28),
 ('Apache Divine', 28),
 ('Rugrats Shakespeare', 28),
 ('Rush Goodfellas', 28),
 ('Zorro Ark', 28),
 ('Rocketeer Mother', 28),
 ('Frost Head', 28)]

Calculate avg number of movies rented by customer.

In [113]:
%%sql
SELECT ROUND(AVG(no_of_rentals)) AS avg_no_of_rentals_per_cutomer FROM (SELECT customer_id, COUNT(inventory_id) AS no_of_rentals FROM rental
GROUP BY customer_id ) AS tmp_rent;

 * postgresql://postgres:***@localhost/dvdrental
1 rows affected.

[(Decimal('27'),)]

Number of customers that rented more than average number of movies.

In [120]:
%%sql
SELECT COUNT(no_of_rentals) AS no_customers_above_avg_rental_rate FROM
(
    SELECT COUNT(inventory_id) AS no_of_rentals FROM rental 
        GROUP BY customer_id
        HAVING COUNT(inventory_id) > 
            (SELECT ROUND(AVG(no_of_rentals)) AS avg_no_of_rentals_per_cutomer FROM (SELECT customer_id, COUNT(inventory_id) AS no_of_rentals FROM rental
            GROUP BY customer_id ) AS tmp_rent)
        ORDER BY no_of_rentalS DESC) AS alias_1;

 * postgresql://postgres:***@localhost/dvdrental
1 rows affected.

[(255,)]

In [6]:
#%sql SHOW TIMEZONE

In [7]:
#%sql SELECT NOW()

Using SQL magic has a drawback in the form of not being able to close the connection to the database. To close the connection to the database you need to kill Notebook kernel.

## **Connecting to database using SQLAlchemy**

In [5]:
#from sqlalchemy import create_engine

In [9]:
#postgres_user_current = str(input('Enter your username'))

In [6]:
#postgres_user_current = 'postgres'

In [11]:
#postgres_pswd_current = str(input('Enter your password'))

In [7]:
#postgres_pswd_current = '#postgreSQL'

In [8]:
# # Postgres username, password, and database name
# POSTGRES_ADDRESS = 'localhost' ## INSERT YOUR DB ADDRESS IF IT'S NOT ON LOCAL MACHINE
# POSTGRES_PORT = '5432'
# POSTGRES_USERNAME = postgres_user_current ## CHANGE THIS TO YOUR POSTGRES USERNAME
# POSTGRES_PASSWORD = postgres_pswd_current ## CHANGE THIS TO YOUR POSTGRES PASSWORD 
# POSTGRES_DBNAME = 'dvdrental' ## CHANGE THIS TO YOUR DATABASE NAME
# # A long string that contains the necessary Postgres login information
# postgres_str = ('postgresql://{username}:{password}@{ipaddress}:{port}/{dbname}'
#                 .format(username=POSTGRES_USERNAME,
#                         password=POSTGRES_PASSWORD,
#                         ipaddress=POSTGRES_ADDRESS,
#                         port=POSTGRES_PORT,
#                         dbname=POSTGRES_DBNAME))
# # Create the connection
# engine = create_engine(postgres_str)

# print("connecting with engine " + str(engine))
# con = engine.connect()

In [9]:
#querry = "SELECT * FROM actor LIMIT 10"

In [10]:
#df = pd.read_sql_query(querry, con)

In [11]:
#df

In [12]:
#con.close()